#### TextNoteLeaderStyles Enumeration

---

|  |
| --- |
| See Also |

An enumerated type listing all the Leader styles.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public enum TextNoteLeaderStyles ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration TextNoteLeaderStyles ``` |

| Visual C++ |
| --- |
| ``` public enum class TextNoteLeaderStyles ``` |

# Members

| Member name | Description |
| --- | --- |
| LCS\_NONE | No leader. |
| LCS\_ONE\_SEG\_LINE | The leader only includes one line segment. |
| LCS\_ONE\_SEG\_ARC | The leader is an arc. |
| LCS\_TWO\_SEG\_LINE | The leader include two line segments. |

# See Also

Autodesk.Revit.DB Namespace